//1. Цель работы: практическое закрепление знаний об инструментальных средствах, используемых при разработке про-
// грамм в среде Linux
// 2. Порядок выполнения:
// (a) в процессе разработки используйте средство контроля версий git, средство отслеживания ошибок (bitbucket.org);
// (b) напишите программу в соответствии с вашим вариантом, разбив ее на различные исходные файлы (не менее
// трех исходных файлов);
// (c) осуществите компиляцию с использованием транслятора и редактора связей gcc, а также программы автомати-
// зации сборки make (Makefile необходимо написать грамотно, чтобы перекомпиляция исходных файлов осуществ-
// лялась только в той части, что изменилась)
// (d) осуществите статический анализ кода с использованием средства cppcheck (используйте опцию --enable=all).
// Исправьте найденные недочеты в вашей программе или подготовьте объяснение того, почему исправление неко-
// торых недочетов не требуется. Включите в отчет скриншоты результатов статического анализа до и после ис-
// правлений. Если изначально не было найдено замечаний, то второй скриншот не требуется.
// (e) осуществите UNIT-тестирование нескольких подпрограмм с помощью [check]https://libcheck.github.io/check/ или
// аналогичного средства. Тестовый набор должен содержать минимум 10 отдельных тестов для минимум трех
// отдельных подпрограмм. Для запуска UNIT-теста создайте соответствующую цель в Makefile.
// (f) осуществите подготовку профиля работы вашей программы (время выполнения и частота вызова каждой подпро-
// граммы) с использованием valgrind и какого-либо средства для демонстрации результатов его работы (например,
// kcachegrind).
// (g) осуществите подготовку распространяемого пакета с использованием autotools (см. http://blablacode.ru/linux/
// 500). В результате у вас должны работать все обычные цели make, включая dist.
// (h) подготовьте документацию вашего продукта с использованием wiki, встроенном в bitbucket.
// Напишите файловую базу данных, управляемую в консольном интерактивном режиме (квазиоконный интерфейс де-
// лать не нужно) с возможностями: добавление, удаление, изменение информации соответственно вашему варианту (на
// языке С). Необходимо осуществить проверку всех возможных ошибок в части некорректных действий пользователя
// и при работе с файлами.
//
//
//8 База данных электричек, поля: вокзал, номер поезда, количество вагонов, тип (экспресс/обычный/спутник),
//станция назначения.
//
//
#include<stdio.h>
//#include "Trains.h"

int main(){

    
    return 0;
}